In [1]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error
from scipy.sparse import csr_matrix
from scipy.sparse.linalg import svds

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# Project 3 - Matrix Factorization methods
#### The goal is to give you practice working with Matrix Factorization techniques

The first thing I did was find a simple tutorial go get familiar with how Singualr Value Decomposition works using numpy/scipy/skikit learn. The below code was taken as practice from [A Gentle Introduction to Singular-Value Decomposition (SVD) for Machine Learning](https://machinelearningmastery.com/singular-value-decomposition-for-machine-learning/)

In [2]:
# Singular-value decomposition
from numpy import array
from scipy.linalg import svd

# define a matrix
A = array([[1,2], [3,4], [5,6]])
print(A)

#SVD
U, s, VT = svd(A)
print(U)
print(s)
print(VT)

[[1 2]
 [3 4]
 [5 6]]
[[-0.2298477   0.88346102  0.40824829]
 [-0.52474482  0.24078249 -0.81649658]
 [-0.81964194 -0.40189603  0.40824829]]
[9.52551809 0.51430058]
[[-0.61962948 -0.78489445]
 [-0.78489445  0.61962948]]

In [3]:
# Reconstruct SVD
from numpy import diag
from numpy import dot
from numpy import zeros

print(A)
# define a matrix
Sigma = zeros((A.shape[0], A.shape[1]))
# populate Sigma with n x n diagonal matrix
Sigma[:A.shape[1], :A.shape[1]] = diag(s)
# reconstruct matrix
B = U.dot(Sigma.dot(VT))
print(B)

[[1 2]
 [3 4]
 [5 6]]
[[1. 2.]
 [3. 4.]
 [5. 6.]]

In [4]:
A = array([[1,2,3], [4,5,6], [7,8,9]])
print(A)
# Singular value decomposition
U, s, VT = svd(A)
# create n x n Sigma matrix
Sigma = diag(s)
# reconstruct matrix
B = U.dot(Sigma.dot(VT))
print(B)

[[1 2 3]
 [4 5 6]
 [7 8 9]]
[[1. 2. 3.]
 [4. 5. 6.]
 [7. 8. 9.]]

The method chosen for this project is Singualar Value Decomposition (SVD). We will be using the small-100k MovieLens dataset to work through the assignment. SVD is a good method to use for matrix factorization, but the caveat is that is needs a desnsely populated matrix. Often times as datasets get bigger their correpsonding matrices become more and more sparse, which is when SVD starts to break down. Since the dataset is not that large, we will impute the missing data for our case.

In cases when the matrix is too large and too sparse for SVD, another method that has been commonly used with success is Alternating Least Squares (ALS). It almost acts as a pendulum swithing back and forth testing new regression lines until the Ordinary Least Squares equation is minimized.  ALS can provide more information about missing data than other methods; a real-world example could be a user being recommended an item they love and didn't know exists.

# Baseline comparison

Let's pull in the ratings data and obtain the average rating. From there we will create a sparse matrix by spreading the dataframe with `pd.pivot()`.

In [5]:
ratings = pd.read_csv('https://raw.githubusercontent.com/mjdacs/data612/master/project_3/ratings.csv?_sm_au_=iVVr3DQvQR5525rM')
ratings.head()
# ratings = pd.read_csv('C:\\Users\\1239783\\Python\\data612-master\\project_2\\ml-latest-small\\ratings.csv')
# movies = pd.read_csv('C:\\Users\\1239783\\Python\\data612-master\\project_2\\ml-latest-small\\movies.csv', index_col='movieId')
# tags = pd.read_csv('C:\\Users\\1239783\\Python\\data612-master\\project_2\\ml-latest-small\\tags.csv')

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [6]:
ratings.rating.mean()

3.501556983616962

In [7]:
ratings_df = ratings.pivot(index='userId', columns='movieId', values='rating')
ratings_df.head()

movieId,1,2,3,4,5,6,7,8,9,10,...,193565,193567,193571,193573,193579,193581,193583,193585,193587,193609
userId,,,,,,,,,,,,,,,,,,,,,
1,4.0,NaN,4.0,NaN,NaN,4.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Training and Test set creation 

The idea here is to split the sparse matrix up into training and test matrices and to calcluate RMSE of the training set's average ratings column against the test set's.

In [8]:
train, test = train_test_split(ratings_df, test_size=0.2)

In [9]:
df_train = pd.melt(train.reset_index(), id_vars='userId')

In [10]:
df_train.head(10)

   userId movieId  value
0     317       1    NaN
1     393       1    NaN
2      60       1    NaN
3     107       1    4.0
4     495       1    NaN
5     329       1    NaN
6     400       1    NaN
7     148       1    NaN
8     231       1    NaN
9     416       1    NaN

In [11]:
train_mean = df_train.value.mean()
train_mean

3.5007301494584198

In [12]:
df_test = pd.melt(test.reset_index(), id_vars='userId')

In [13]:
df_test.head(10)

   userId movieId  value
0     371       1    NaN
1     207       1    NaN
2     316       1    NaN
3     155       1    3.0
4     494       1    NaN
5     563       1    NaN
6     463       1    NaN
7     109       1    NaN
8     575       1    NaN
9     246       1    NaN

Here is where we add a new column containing the mean value of the training set's ratings

In [14]:
df_test = (df_test
           .assign(training_mean=train_mean)
           .rename(columns={'value': 'rating'}))
df_test.head()

   userId movieId  rating  training_mean
0     371       1     NaN        3.50073
1     207       1     NaN        3.50073
2     316       1     NaN        3.50073
3     155       1     3.0        3.50073
4     494       1     NaN        3.50073

In [15]:
df_test.shape

(1186328, 4)

Here we can use `np.isfinite` to isolate and drop the `Nan`'s in the rating column.

In [16]:
df_final_test = df_test[np.isfinite(df_test.rating)]
df_final_test.head()

    userId movieId  rating  training_mean
3      155       1     3.0        3.50073
11     411       1     5.0        3.50073
15     270       1     5.0        3.50073
18     596       1     4.0        3.50073
28     567       1     3.5        3.50073

In [17]:
df_final_test.shape

(22085, 4)

In [18]:
mse = mean_squared_error(df_final_test.rating, df_final_test.training_mean)
print(f'The mean squared error is: {mse}')

The mean squared error is: 1.1423190615428536

The RMSE looks decent from a baseline perspective. Let's see how much better we can get it with SVD


### Singular Value Decomposition

Let's take another peak at the training set sparse matrix. The plan is to impute the mean value over all `NaN`'s in the matrix.

In [19]:
train.head()

movieId,1,2,3,4,5,6,7,8,9,10,...,193565,193567,193571,193573,193579,193581,193583,193585,193587,193609
userId,,,,,,,,,,,,,,,,,,,,,
317,NaN,NaN,NaN,NaN,NaN,5.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
393,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
60,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
107,4.0,5.0,NaN,NaN,4.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
495,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [20]:
# Impute and convert from df to array using .values
imputed_train = ratings_df.fillna(train_mean).values
imputed_train

array([[4.        , 3.50073015, 4.        , ..., 3.50073015, 3.50073015,
        3.50073015],
       [3.50073015, 3.50073015, 3.50073015, ..., 3.50073015, 3.50073015,
        3.50073015],
       [3.50073015, 3.50073015, 3.50073015, ..., 3.50073015, 3.50073015,
        3.50073015],
       ...,
       [2.5       , 2.        , 2.        , ..., 3.50073015, 3.50073015,
        3.50073015],
       [3.        , 3.50073015, 3.50073015, ..., 3.50073015, 3.50073015,
        3.50073015],
       [5.        , 3.50073015, 3.50073015, ..., 3.50073015, 3.50073015,
        3.50073015]])

Here is where we get to apply the lessons learned from the introduction...

In [21]:
U, s, VT = svds(imputed_train, k=50)

In [22]:
print(U.shape, s.shape, VT.shape)

(610, 50) (50,) (50, 9724)

In [23]:
Sigma = np.diag(s)

In [24]:
B = U.dot(Sigma.dot(VT))
B.shape

(610, 9724)

After the matrix is reconstructed we can throw it into a dataframe and use `pd.melt()` to convert the data to a tidy, long format in order to calculate the RMSE.

In [25]:
df_B = pd.DataFrame(B)
df_B.index = ratings_df.index
df_B.columns = ratings_df.columns
df_B.head()

movieId,1,2,3,4,5,6,7,8,9,10,...,193565,193567,193571,193573,193579,193581,193583,193585,193587,193609
userId,,,,,,,,,,,,,,,,,,,,,
1,3.901847,3.606622,3.799008,3.502473,3.600844,3.862270,3.396457,3.508993,3.572248,3.692262,...,3.508456,3.511536,3.505375,3.505375,3.508456,3.505375,3.508456,3.508456,3.508456,3.505007
2,3.536988,3.490575,3.460846,3.491921,3.520737,3.466901,3.469670,3.503989,3.497620,3.531642,...,3.500590,3.498295,3.502885,3.502885,3.500590,3.502885,3.500590,3.500590,3.500590,3.501414
3,3.300229,3.372243,3.406078,3.490148,3.431000,3.385462,3.383278,3.506814,3.511550,3.566217,...,3.504305,3.501651,3.506959,3.506959,3.504305,3.506959,3.504305,3.504305,3.504305,3.504790
4,3.347474,3.283697,3.359155,3.479150,3.509644,3.363078,3.382318,3.439954,3.571199,3.349207,...,3.497035,3.494956,3.499114,3.499114,3.497035,3.499114,3.497035,3.497035,3.497035,3.495778
5,3.735648,3.483028,3.476074,3.482595,3.489847,3.607696,3.515356,3.496763,3.483195,3.479498,...,3.501874,3.501436,3.502312,3.502312,3.501874,3.502312,3.501874,3.501874,3.501874,3.502390

In [26]:
tidy_B = pd.melt(df_B.reset_index(), id_vars='userId')
tidy_B.head()

   userId movieId     value
0       1       1  3.901847
1       2       1  3.536988
2       3       1  3.300229
3       4       1  3.347474
4       5       1  3.735648

Lastly we merge the test set values and the SVD values. We check to make sure there are no `NaN`s and calculate the RMSE.

In [30]:
SVD_eval = pd.merge(df_final_test, tidy_B, how='left',
                   left_on=['userId', 'movieId'],
                   right_on=['userId', 'movieId'])
SVD_eval = SVD_eval.rename(columns={'rating': 'test_values', 'value': 'SVD_values'})
SVD_eval.isna().sum()

userId           0
movieId          0
test_values      0
training_mean    0
SVD_values       0
dtype: int64

In [31]:
SVD_eval.head()

   userId movieId  test_values  training_mean  SVD_values
0     155       1          3.0        3.50073    3.497310
1     411       1          5.0        3.50073    3.963150
2     270       1          5.0        3.50073    3.715610
3     596       1          4.0        3.50073    3.958774
4     567       1          3.5        3.50073    3.409619

In [44]:
svd_mse = mean_squared_error(SVD_eval.test_values, SVD_eval.SVD_values)
print(f'The RMSE for SVD is: {svd_mse}')
print(f'A reduction of {round(((mse - svd_mse) / mse * 100),1)}%')

The RMSE for SVD is: 0.406587053231737
A reduction of 64.4%

The RMSE using Singular Value Decomposition reduced the RMSE a staggering 64.4%. I am really surprised it worked this much better, and wonder if there could be some user error involved one way or another. It would be interesting to see how Alternating Least Squares would work since it is often known to be even more accurate.